vaynersystems/esp32-mvc-secure-iot-server/src/System/ROUTER/esp32_router.cpp
#ifndef _ESP32_ROUTER_CPP
#define _ESP32_ROUTER_CPP
#include "esp32_router.h"
#include "../Config.h"
#include "../CORE/esp32_server.h"

extern esp32_server server;



void esp32_router::InitConfigurableRouting()
{
    
    
}

void esp32_router::RegisterHandler(ResourceNode* resourceNode) {
    RegisterHandler( resourceNode->_path.c_str(), resourceNode->getMethod().c_str(), resourceNode->_callback);
}
void esp32_router::RegisterHandler(String nodeMapPath, HTTPMETHOD method, HTTPSCallbackFunction* handler) {
    String methodName;
    switch (method) {
    case HTTPMETHOD_GET:
        methodName = "GET";
        break;
    case HTTPMETHOD_POST:
        methodName = "POST";
        break;
    case HTTPMETHOD_DELETE:
        methodName = "DELETE";
        break;
    case HTTPMETHOD_PUT:
        methodName = "PUT";
        break;
    }
    RegisterHandler( nodeMapPath, methodName, handler);
}

void esp32_router::RegisterHandlers(fs::FS& fs, const char* dirname, uint8_t levels) {
    File root = fs.open(dirname);
    if (!root) {
        //Serial.println("- failed to open directory");
        return;
    }
    if (!root.isDirectory()) {
        //Serial.println(" - not a directory");
        return;
    }

    File file = root.openNextFile();
    while (file) {
        if (file.isDirectory()) {
            //Serial.print("  DIR : ");
            //Serial.println(file.name());
            if (levels) {
                esp32_fileio::listDir(fs, &Serial, file.name(), levels - 1);
            }
        }
        else {
            //Register file handler as filename
          //  esp32_router::RegisterHandler( file.name(), HTTPMETHOD_GET, &handleFile);

            String mappingPath = String(file.name());
            mappingPath.remove(0, sizeof(SITE_ROOT) - 1);

            RegisterHandler( mappingPath.c_str(), HTTPMETHOD_GET, &handleFile);


            int startIdx = mappingPath.lastIndexOf('/');
            if (startIdx > 0) {
                String filePath = mappingPath.substring(startIdx);
                if (filePath.length() > 0)
                    RegisterHandler( filePath.c_str(), HTTPMETHOD_GET, &handleFile);
            }

            //if gz file, register handler without gz
            if (String(file.name()).endsWith(".gz")) {
                String nonGZName = String(file.name());
                nonGZName.remove(nonGZName.length() - 3);

                RegisterHandler( nonGZName.c_str(), HTTPMETHOD_GET, &handleFile);

                nonGZName.remove(0, sizeof(SITE_ROOT) - 1);
               //Serial.printf(" Resistering GZ Handler[%s , %s]\n", file.name(), nonGZName.c_str());
                RegisterHandler( nonGZName.c_str(), HTTPMETHOD_GET, &handleFile);
                /*

                int startIdx = nonGZName.lastIndexOf('/');
                if (startIdx > 0) {
                    String filePath = nonGZName.substring(startIdx);
                    if (filePath.length() > 0)
                        RegisterHandler(filePath.c_str(), HTTPMETHOD_GET, &handleHTTPFile);
                }*/
            }
        }
        file = root.openNextFile();
    }
}


void esp32_router::RegisterHandler(String nodeMapPath, String method, HTTPSCallbackFunction* handler) {
    //Serial.print(" Registering Handler for [");
    //Serial.print(nodeMapPath);
    //Serial.println("]\t ");


    ResourceNode* node = new ResourceNode(nodeMapPath.c_str(), method.c_str(), handler);
    server.secureServer->registerNode(node);
    server.unsecureServer->registerNode(node);
    /*httpsserver::ResourceResolver* cast = dynamic_cast<httpsserver::ResourceResolver*>(&server.secureServer);
    cast->registerNode(node);*/
}




void esp32_router::handleCORS(HTTPRequest* req, HTTPResponse* res) {
    Serial.println(">> CORS here...");
    res->setHeader("Access-Control-Allow-Methods", "GET,POST,OPTIONS");
    res->setHeader("Access-Control-Allow-Origin", "*");
    res->setHeader("Access-Control-Allow-Headers", "*");
}

void esp32_router::handleFileList(HTTPRequest* req, HTTPResponse* res) {
    std::string dir,path,path_dir, filter;
    req->getParams()->getQueryParameter("dir", dir);
    req->getParams()->getQueryParameter("path", path);
    req->getParams()->getQueryParameter("filter", filter);
    
    res->setHeader("Content-Type", "application/json");
    if (path.length() > 0) {
        //search path
        if(path.length() > 1 && path[path.length() - 1] == '/')
            path = path.substr(0,path.length() - 1);

        std::list<std::string> files = std::list<std::string>();
        // if (path.find_last_of('/' > 0))
        //     path_dir = path.substr(0, path.find_last_of('/'));
        // else
        path_dir = path;
        Serial.printf("Searching for files only in path %s\n", path_dir.c_str());
        esp32_fileio::buildOrderedFileList(SPIFFS, path_dir.c_str(), filter.c_str(), 3, &files,false);
        esp32_fileio::printFileSearchOrdered(res, &files,filter);
    }
    else {
        //print dir recursivly
        if (dir.length() <= 0) dir = "/";
        Serial.printf("Empty path, starting from %s\n", dir.c_str());
        
        std::list<std::string> files = std::list<std::string>();
        esp32_fileio::buildOrderedFileList(SPIFFS, dir.c_str(), filter.c_str(), 3, &files);
        esp32_fileio::printDirOrdered(res, &files);
    }

    //esp32_fileio::listDir(SPIFFS, res, dir.c_str(), 3, HTTP_FORMAT::JSON);
}

int esp32_router::handlePagePart_Title(HTTPRequest* req, HTTPResponse* res, String line, std::string content = "")
{
    if(content.length() <= 0)
        return handlePagePart_FromFile(req, res, line, HTML_REF_CONST_TITLE, (req->getHeader(HEADER_AUTH).length() > 0) ? "/T/title_int.html" : "/T/title_pub.html");
    
    return handlePagePart_FromString(req, res, line, HTML_REF_CONST_TITLE, content);
   
}

int esp32_router::handlePagePart_Head(HTTPRequest* req, HTTPResponse* res, String line, std::string content = "")
{
    if (content.length() <= 0)
        return handlePagePart_FromFile(req, res, line, HTML_REF_CONST_HEAD, "/T/head.html");  

    return handlePagePart_FromString(req, res, line, HTML_REF_CONST_HEAD, content);
}

