vaynersystems/esp32-mvc-secure-iot-server/src/System/ROUTER/esp32_router.cpp
int esp32_router::handlePagePart_Header(HTTPRequest* req, HTTPResponse* res, String line, std::string content = "")
{
    if (content.length() <= 0)
        return handlePagePart_FromFile(req, res, line, HTML_REF_CONST_HEADER, (req->getHeader(HEADER_GROUP).length() > 0) ? "/T/header_int.html" : "/T/header_pub.html");

    return handlePagePart_FromString(req, res, line, HTML_REF_CONST_HEADER, content);
}
int esp32_router::handlePagePart_Menu(HTTPRequest* req, HTTPResponse* res, String line, std::string content = "")
{
    if (content.length() <= 0)
        return handlePagePart_FromFile(req, res, line, HTML_REF_CONST_MENU, (req->getHeader(HEADER_GROUP).length() > 0) ? "/T/menu_int.html" : "/T/menu_pub.html");

    return handlePagePart_FromString(req, res, line, HTML_REF_CONST_MENU, content);
}

int esp32_router::handlePagePart_Content(HTTPRequest* req, HTTPResponse* res, String line, std::string content = "")
{
    if (content.length() <= 0) {
        int idx = line.indexOf(HTML_REF_CONST_CONTENT);
        if (idx < 0) return idx;
        res->print(line.substring(0, idx));
        handleFile(req, res);
        //String contentFileName = SITE_ROOT;

        //std::string reqStr = req->getRequestString(), controller(""),action("");
        //std::string queryString("");
        //int queryStart = reqStr.find_first_of('?');
        //if (queryStart > 0)
        //{
        //    queryString = reqStr.substr(queryStart+1);
        //    reqStr.erase(queryStart);
        //}
        //if (reqStr.find_first_of('/') == 0) //remove leading slash
        //    reqStr.erase(0,1);
        //int reqIdxSlash = reqStr.find_first_of('/');
        //if (reqIdxSlash > 0)
        //{
        //    controller = reqStr.substr(0, reqIdxSlash);
        //    reqStr.erase(0, reqIdxSlash+1);
        //    reqIdxSlash = reqStr.find_first_of('/');
        //    if (reqIdxSlash > 0)
        //    {
        //        action = reqStr.substr(0, reqIdxSlash);
        //        reqStr.erase(0, reqIdxSlash+1);           
        //    }
        //    else {
        //        action = reqStr;
        //        reqStr.erase(0);
        //    }
        //    Serial.printf("Parsed url. Controller=%s Action=%s, Remainder=%s Query=%s\n",controller.c_str(), action.c_str(),reqStr.c_str(), queryString.c_str());
        //}
        //bool validController = controllerFactory->hasInstance(controller.c_str());
        //if (!validController) {
        //    handle404(req, res);
        //}
        //else {
        //    auto controllerObj = controllerFactory->createInstance(controller.c_str());
        //    if (controllerObj == NULL)
        //        handle404(req, res);
        //    else {
        //        controllerObj->Action(req, res, action.c_str());
        //    }
        //}

        //contentFileName += "/T/C/";
        //contentFileName += controller.c_str();
        //contentFileName += ".cpp";

        //File fContent = SPIFFS.open(contentFileName);
        //while (fContent.available()) {
        //    res->print(fContent.readStringUntil('\n'));
        //    if (fContent.available()) res->print('\n'); //print new line if not last line to be read
        //}
        //fContent.close();

        res->println(line.substring(idx + sizeof(HTML_REF_CONST_CONTENT) - 1));

        return idx;
    }

    return handlePagePart_FromString(req, res, line, HTML_REF_CONST_CONTENT, content);
    
}


int esp32_router::handlePagePart_Content(HTTPRequest* req, HTTPResponse* res, String line, Base_Controller * controller)
{
    int idx = line.indexOf(HTML_REF_CONST_CONTENT);
    if (idx < 0) return idx;
    res->print(line.substring(0, idx));
    if (!controller->controllerTemplate.RenderTemplate(req, res))
        handle404(req, res);//if not able to render template, handle with 404
    res->println(line.substring(idx + sizeof(HTML_REF_CONST_CONTENT) - 1));

    return idx;
}

int esp32_router::handlePagePart_Footer(HTTPRequest* req, HTTPResponse* res, String line, std::string content = "")
{   
    if (content.length() <= 0) {
        int idx = line.indexOf(HTML_REF_CONST_FOOTER);
        if (idx < 0) return idx;
        res->print(line.substring(0, idx));

        auto footerModule = /*controllerFactory->hasInstance(route.controller) ? */
            controllerFactory->createInstance("_footer", "index");// : NULL;

        //esp32_template controllerTemplate = esp32_template();
        if (footerModule != NULL) {
                //module found
            footerModule->Action(req, res); //execute module action

            //render module output
            if (!footerModule->controllerTemplate.RenderTemplate(req, res))
                HTTPS_LOGE("Failure to render footer template");     

            res->println(line.substring(idx + sizeof(HTML_REF_CONST_FOOTER) - 1));
            return idx;
                
        }
        return handlePagePart_FromFile(req, res, line, HTML_REF_CONST_FOOTER, "/W/T/V/_footer.html");
    }
    /*else {
        res->print(content.c_str());
    }
    res->println(line.substring(idx + sizeof(HTML_REF_CONST_FOOTER) - 1));

    return idx;*/

    return handlePagePart_FromString(req, res, line, HTML_REF_CONST_FOOTER, content);
}

int esp32_router::handlePagePart_FromFile(HTTPRequest* req, HTTPResponse* res, String line, const char * searchString, String fileName){
    
    int idx = line.indexOf(searchString);
    if (idx >= 0) {
        String fFileName = SITE_ROOT;
        fFileName += fileName;

        Serial.printf("\t[PagePart Parser]. Found %s in %s. Filling from %s. \n", searchString, line.c_str(), fFileName.c_str());
        res->print(line.substring(0, idx).c_str());
        
        //Serial.printf("[PREFIX] %s\n", line.substring(0, idx).c_str());

        if (SPIFFS.exists(fFileName.c_str())) {
            File fPagePart = SPIFFS.open(fFileName);

            while (fPagePart.available()) {
                String docLine = fPagePart.readStringUntil('\n');
                res->print(docLine.c_str());
                if (fPagePart.available()) res->print('\n'); //write new line if not last line
                //Serial.printf("[CONTENT] %s\n", docLine.c_str());
            }
            fPagePart.close();

