vaynersystems/esp32-mvc-secure-iot-server/src/System/ROUTER/esp32_router.cpp
        }
        else
        {
            Serial.printf("File %s not found.\n", fFileName.c_str());
            res->printf("Page Part %s file %s NOT FOUND!",searchString,fFileName.c_str());
        }
        res->println(line.substring(idx + strlen(searchString)).c_str());
        //Serial.printf("[SUFFIX] %s\n\n", line.substring(idx + strlen(searchString)).c_str());
    }
    

    return idx;// > 0 ? idx : 0;
}
int esp32_router::handlePagePart_FromString(HTTPRequest* req, HTTPResponse* res, String line, const char* searchString, std::string content) {

    int idx = line.indexOf(searchString);
    if (idx >= 0) {


        //Serial.printf("[PagePart Parser]. Found %s in %s. Filling from string. ", searchString, line.c_str());
        res->print(line.substring(0, idx).c_str());

       // Serial.printf("[PREFIX] %s\n", line.substring(0, idx).c_str());
        res->print(content.c_str());
        //Serial.printf("[CONTENT] %s\n", content.c_str());

        res->println(line.substring(idx + strlen(searchString)).c_str());
        //Serial.printf("[SUFFIX] %s\n\n", line.substring(idx + strlen(searchString)).c_str());
    }

    return idx;// > 0 ? idx : 0;
}
//Get the route information for a controler/action syntax. returns true if controller found, false otherwise
bool esp32_router::GetControllerRoute(std::string reqString, esp32_controller_route& routeObj)
{

    std::string controller(""), action("");
    std::string queryString("");
    int queryStart = reqString.find_first_of('?');
    if (queryStart > 0)
    {
        queryString = reqString.substr(queryStart + 1);
        reqString.erase(queryStart);
    }
    if (reqString.find_first_of('/') == 0) //remove leading slash
        reqString.erase(0, 1);

    //default controller if none is specified
    //TODO: configurable default controller, configure on/off
    controller = "invalid";//"esp32_home";
    if(strstr(reqString.c_str(),"index.html") != nullptr || reqString.length() == 0)
        controller = "esp32_home";
    action = "index";

    int reqIdxSlash = reqString.find_first_of('/');
    if (reqIdxSlash > 0)
    {
        controller = reqString.substr(0, reqIdxSlash);
        reqString.erase(0, reqIdxSlash + 1);
        reqIdxSlash = reqString.find_first_of('/');
        if (reqIdxSlash > 0)
        {
            action = reqString.substr(0, reqIdxSlash);
            reqString.erase(0, reqIdxSlash + 1);
        }
        else {
            action = reqString;
            reqString.erase(0);
        }
        Serial.printf("Parsed url. Controller=%s Action=%s, Remainder=%s Query=%s\n", controller.c_str(), action.c_str(), reqString.c_str(), queryString.c_str());
    }
    routeObj.action = action;
    routeObj.controller = controller;
    routeObj.params = reqString;
   return controllerFactory->hasInstance(controller.c_str());
    
}

void esp32_router::handleFileUpload(HTTPRequest* req, HTTPResponse* res) {
    if (req->getMethod() == "DELETE") {
        res->println("<html><head><title>File Deleted</title><head><body><h1>File Deleted</h1>");

        HTTPURLEncodedBodyParser parser(req);
        std::string filename, filePath;
        bool savedFile = false;
        while (parser.nextField()) {
            std::string name = parser.getFieldName();
            Serial.printf("Parsing field %s\n", name.c_str());
            if (name.substr(0, strlen("------WebKitFormBoundary")).compare("------WebKitFormBoundary") == 0) {
                char buf[512];
                size_t readLength = parser.read((byte*)buf, 512);
                filePath = std::string(buf, readLength);
                Serial.printf("Parsing substring from idx %d to idx %d\n", filePath.find_first_of("://"), filePath.find_first_of("------"));
                filePath = filePath.erase(0, filePath.find_first_of("://"));
                filePath = filePath.erase(filePath.find_first_of("------") - 2);
                Serial.printf("Received request to delete %s.\n", filePath.c_str());

                filename = filePath.substr(filePath.find_first_of('?') + 1);
                if (filename == "") {
                    res->println("<p>Error: form contained content before filename.</p>");
                    break;
                }
                if (!SPIFFS.exists(filename.c_str())) {
                    res->printf("File [%s] with at path %s not found.", filename.c_str(), filePath.c_str());
                    //break;
                }
                SPIFFS.remove(filename.c_str());
                res->printf("<p>Deleted %s</p>", filename.c_str());
                savedFile = true;
            }
            else {
                Serial.printf("Expected string %s. Instead found %s\n", "------WebKitFormBoundary", name.substr(0, strlen("------WebKitFormBoundary")).c_str());
            }
            /* else {
                 res->printf("<p>Unexpected field %s</p>", name.c_str());
             }*/
        }
        if (!savedFile) {
            res->println("<p>No file to delete...</p>");
        }
        res->println("</body></html>");
        return;
    }
    else if (req->getMethod() == "GET") {}
    res->println("<html><head><title>File Edited</title><head><body><h1>File Edited</h1>");
    HTTPMultipartBodyParser* parser;
    std::string contentType = req->getHeader("Content-Type");
    size_t semicolonPos = contentType.find(";");
    bool savedFile = false;
    if (semicolonPos != std::string::npos) {
        contentType = contentType.substr(0, semicolonPos);
    }
    if (contentType == "multipart/form-data") {
        parser = new HTTPMultipartBodyParser(req);
    }
    else {
        Serial.printf("Unknown POST Content-Type: %s\n", contentType.c_str());
        return;
    }
    std::string filename;
    while (parser->nextField()) {
        std::string name = parser->getFieldName();
        Serial.printf("Parsing field %s\n", name.c_str());
        char buf[512];
        if (name == "filename") {

            size_t readLength = parser->read((byte*)buf, 512);
            filename = std::string("/") + std::string(buf, readLength);
        }
        else if (name == "data") {
            filename = parser->getFieldFilename();
            //size_t readLength = parser->read((byte*)buf, 512);
            //std::string filePath = std::string(buf, readLength);
            //check if it comes from 
            int startIdx = filename.find_first_of("?");
            if (startIdx < 0) //no filename yet
            {
                //    res->printf("File path not valid\n");
                //    break;
                //} else
                //if (startIdx == 0) //no filename yet
                //{
                res->printf("POST.. no prefix\n");
                //break;
            }
            else {
                startIdx++;
                filename = filename.substr(startIdx);
            }

            // Serial.printf("Uploading %s\n", filename.c_str());
             //Serial.printf("Parsing substring from idx %d\n", ++startIdx);

            if (filename == "") {
                res->println("<p>Error: form contained content before filename.</p>");
                break;
            }
            else
            {
                Serial.printf("Writing %u bytes to file [%s]..", req->getContentLength(), filename.c_str());
                size_t fieldLength = 0;
                //if(!SPIFFS.exists(filename.c_str())) break;
                File file = SPIFFS.open(filename.c_str(), "w");
                savedFile = true;
                while (!parser->endOfField()) {
                    byte buf[512];
                    size_t readLength = parser->read(buf, 512);
                    file.write(buf, readLength);
                    fieldLength += readLength;
                }
                file.close();
                Serial.println("Done.");
                res->printf("<p>Saved %d bytes to %s</p>", int(fieldLength), filename.c_str());
            }
        }
        else {
            res->printf("<p>Unexpected field %s</p>", name.c_str());
        }
    }
    if (!savedFile) {
        res->println("<p>No file to save...</p>");
    }
    res->println("</body></html>");
    // Serial.printf("Uploading file %s completed successfully!\n", name.c_str());

