vaynersystems/esp32-mvc-secure-iot-server/src/System/ROUTER/esp32_router.cpp
}
// This is the internal page. It will greet the user with
// a personalized message and - if the user is in the ADMIN group -
// provide a link to the admin interface.
void esp32_router::handleInternalPage(HTTPRequest* req, HTTPResponse* res) {
    // Header
    res->setStatusCode(200);
    res->setStatusText("OK");
    res->setHeader("Content-Type", "text/html; charset=utf8");

    // Write page
    res->println("<!DOCTYPE html>");
    res->println("<html>");
    res->println("<head>");
    res->println("<title>Internal Area</title>");
    res->println("<script src = \"/JS/auth.js\"></script>");
    res->println("</head>");
    res->println("<body>");

    // Personalized greeting
    res->print("<h1>Hello ");
    // We can safely use the header value, this area is only accessible if it's
    // set (the middleware takes care of this)
    res->printStd(req->getHeader(HEADER_USERNAME));
    res->print("!</h1>");

    res->println("<p>Welcome to the internal area. Congratulations on successfully entering your password!</p>");

    // The "admin area" will only be shown if the correct group has been assigned in the authenticationMiddleware
    if (req->getHeader(HEADER_GROUP) == "ADMIN") {
        res->println("<div style=\"border:1px solid red;margin: 20px auto;padding:10px;background:#ff8080\">");
        res->println("<h2>You are an administrator</h2>");
        res->println("<p>You are allowed to access the admin page:</p>");
        res->println("<p><a href=\"#\" onclick=\"link('/internal/admin')\">Go to secret admin page</a></p>");
        res->println("</div>");
    }

    // Link to the root page
    res->println("<p><a href=\"/\">Go back home</a></p>");
    res->println("</body>");
    res->println("</html>");
}

void esp32_router::handleAdminPage(HTTPRequest* req, HTTPResponse* res) {
    // Headers
    res->setHeader("Content-Type", "text/html; charset=utf8");

    std::string header = "<!DOCTYPE html><html><head><title>Secret Admin Page</title><script src = \"/JS/auth.js\"></script></head><body><h1>Secret Admin Page</h1>";
    std::string footer = "</body></html>";

    // Checking permissions can not only be done centrally in the middleware function but also in the actual request handler.
    // This would be handy if you provide an API with lists of resources, but access rights are defined object-based.
    if (req->getHeader(HEADER_GROUP) == "ADMIN") {
        res->setStatusCode(200);
        res->setStatusText("OK");
        res->printStd(header);
        res->println("<div style=\"border:1px solid red;margin: 20px auto;padding:10px;background:#ff8080\">");
        res->println("<h1>Congratulations</h1>");
        res->println("<p>You found the secret administrator page!</p>");
        res->println("<p><a href=\"#\" onclick=\"link('/internal')\">Go back</a></p>");
        res->println("</div>");
    }
    else {
        res->printStd(header);
        res->setStatusCode(403);
        res->setStatusText("Unauthorized");
        res->println("<p><strong>403 Unauthorized</strong> You have no power here!</p>");
    }

    res->printStd(footer);
}

// Just a simple page for demonstration, very similar to the root page.
void esp32_router::handlePublicPage(HTTPRequest* req, HTTPResponse* res) {   
   /* res->setHeader("Content-Type", "text/html");
    res->println("<!DOCTYPE html>");
    res->println("<html>");
    res->println("<head><title>Hello World!</title></head>");
    res->println("<body>");
    res->println("<h1>Hello World!</h1>");
    res->print("<p>Your server is running for ");
    res->print((int)(millis() / 1000), DEC);
    res->println(" seconds.</p>");
    res->println("<p><a href=\"/\">Go back</a></p>");
    res->println("</body>");
    res->println("</html>");*/
    std::string content = "<H1>Public Page</h1>\n"
        "<p>Your server is running for\n";
    content.append(String((int)millis() / 100).c_str());
    content.append(" seconds.</p>");
    handleRoot(req, res, &content);
}

void esp32_router::handleRoot(HTTPRequest* req, HTTPResponse* res,std::string* content) {
   
    
    res->setHeader("Content-Type", "text/html");

    esp32_controller_route route;
    if (GetControllerRoute(req->getRequestString(),route)) {
        //route is under controller
        
        auto controllerObj = /*controllerFactory->hasInstance(route.controller) ? */
            controllerFactory->createInstance(route);// : NULL;
        
        //esp32_template controllerTemplate = esp32_template();
        if (controllerObj == NULL) {
            handle404(req, res);
            return;
        }
       
        controllerObj->Action(req, res);
        String path = SITE_ROOT;
        path += "/T/_template.html";
        File f = SPIFFS.open(path);
        res->setStatusCode(200);
        res->setStatusText("OK");
        res->setHeader("Content-Type", "text/html");
        Serial.printf("[esp32_router::handleRoot] Opening file %s\n", f.path());
        while (f.available()) {
            String line = f.readStringUntil('\n');
            //if we already processed a section, skip trying to reprocess
            int titleidx = 0,
                headidx = 0,
                menuidx = 0,
                headeridx = 0,
                contentidx = 0,
                footeridx = 0;

            titleidx = handlePagePart_Title(req, res, line, controllerObj->title);
            if (titleidx > 0) {
                continue;
            }
            headidx = handlePagePart_Head(req, res, line, controllerObj->head);
            if (headidx > 0) {
                continue;
            }
            menuidx = handlePagePart_Menu(req, res, line, controllerObj->menu);
            if (menuidx > 0) {
               continue;
            }
            headeridx = handlePagePart_Header(req, res, line,"");//TODO: oops .. missed that one
            if (headeridx > 0) {
                continue;
            }
            //serve content from stream or controller object
            content != nullptr && content->length() > 0 ?
                contentidx = handlePagePart_Content(req, res, line, *content):
                handlePagePart_Content(req, res, line, controllerObj);
            if (contentidx > 0) {
               continue;
            }
            footeridx = handlePagePart_Footer(req, res, line,controllerObj->footer);
            if (footeridx > 0) {
                continue;
            }


            bool anyReplaced = titleidx >= 0 || headidx >= 0 || headeridx >= 0 || menuidx >= 0 || contentidx >= 0 || footeridx >= 0;
            if (!anyReplaced) {
               /* Serial.printf("[CONTENT WRITER] %s\n", line.c_str());*/
                res->println(line);
            }

