vaynersystems/esp32-mvc-secure-iot-server/src/System/ROUTER/esp32_router.cpp
        }
        f.close();
        Serial.printf("[ESP ROUTER]Serving page from template %s\n", path.c_str());
        //writeFileToResponse(path.c_str(), res);
    }
    else
    {
        Serial.printf("[ESP ROUTER]Serving page from file %s\n", req->getRequestString().c_str());
        writeFileToResponse(req->getRequestString().c_str(), res);
    }

    

    

    //TODO: fill menu and file from spiffs
}

//void handleEditPage(HTTPRequest* req, HTTPResponse* res) {
//    String path = SITE_ROOT;
//    path += "/edit.htm.gz";
//    File f = SPIFFS.open(path);
//
//    if (f.size() <= 0) return;
//    Serial.print("Providing Edit.htm.gz file "); Serial.print(f.size()); Serial.println(" bytes.");
//    res->setHeader("Content-Encoding", "gzip");
//    char buff[256];
//    while (true) {
//        
//        uint16_t bytestoRead = f.available() < 256 ? f.available() : 256;
//        if (bytestoRead == 0) break;
//        f.readBytes(buff, bytestoRead);
//        res->write((uint8_t*)buff, bytestoRead);
//        Serial.printf("Wrote %u bytes from %s\n", bytestoRead, f.name());
//    }
//
//}
void esp32_router::writeFileToResponse(const char* filePath,HTTPResponse* res){
    //Check if we zip
    bool useGZ = false;
    bool download = false;
    //check if gz version exists
    String fileName = String(filePath);
    if (!fileName.startsWith(SITE_ROOT))
        fileName = SITE_ROOT + fileName;

    Serial.printf("[3.1] Loading file %s.\n", fileName.c_str());
    //url decode
    fileName = urlDecode(fileName.c_str()).c_str();
    //if part of parameter
    int startIdx = fileName.indexOf("?");
    if (startIdx > 0) {
        startIdx++;
        fileName = fileName.substring(startIdx);
    }
    //check if we have an end
    int endIdx = fileName.indexOf("?");
    if (endIdx > 0) {
        if (fileName.substring(endIdx + 1).compareTo("download=true") == 0)
            download = true;
        else
            //Serial.printf("Found second ? but expected download=true not found. [%s]\n", fileName.substring(endIdx + 1).c_str());
        fileName = fileName.substring(0, endIdx);
    }

    String gzName = fileName + ".gz";
    if (SPIFFS.exists(gzName))
        useGZ = true;
    String ext = fileName.substring(fileName.lastIndexOf('.') + 1).c_str();

    File f;
    Serial.printf("[3.2] Loading file %s.\n", (useGZ ? gzName : fileName).c_str());
    if (!SPIFFS.exists(useGZ ? gzName : fileName)) {
        //Serial.printf("File not found: %s\n", useGZ ? gzName.c_str() : fileName.c_str());
        string fileName = SITE_ROOT;
        fileName +=
            ext == "js" ? "/JS/" :
            ext == "css" ? "/CSS/" : "/";
        fileName += std::string(filePath).substr(fileName.find_last_of('/') + 1).c_str();
       //Serial.printf("[HTTP]1. Opening file %s\n", fileName.c_str());
        f = SPIFFS.open(fileName.c_str());
        if (f.size() < 0)
        {
            //finnaly check if its gz file
            fileName += ".gz";
            //Serial.printf("[1.1 - GZ loosely linked] Opening file %s\n", fileName.c_str());
            f = SPIFFS.open(fileName.c_str());
            if (f.size() <= 0)
                return;
            else useGZ = true;
        }
    }
    else {
        Serial.printf("Found file %s in %s format with extention %s\n", useGZ ? gzName.c_str() : fileName.c_str(), useGZ ? "GZ" : "REG", ext);
        f = SPIFFS.open(useGZ ? gzName : fileName);
    }
    // if (f.size() <= 0) {
    //     f.close();
    //     //try corrected path

    //     String fileName = SITE_ROOT;
    //     fileName +=
    //         ext == "js" ? "/JS/" :
    //         ext == "css" ? "/CSS/" : "/";
    //     fileName += req->getRequestString().substr(req->getRequestString().find_last_of('/') + 1).c_str();
    //     Serial.printf("[HTTP]2. Opening file %s\n", fileName.c_str());
    //     f = SPIFFS.open(fileName);
    //     if (f.size() <= 0)
    //     {
    //         f.close();
    //         //finnaly check if its gz file
    //         fileName += ".gz";
    //         Serial.printf("[2.1 - GZ loosely linked] Opening file %s\n", fileName.c_str());
    //         f = SPIFFS.open(fileName);
    //         if (f.size() <= 0){
    //             Serial.printf("[2.2 - GZ Failed to load. Quitting]");
    //             return;
    //         }
    //         else useGZ = true;
    //     }
    // }
    Serial.printf("Providing %s file ", f.name());  Serial.print(f.size()); Serial.println(" bytes.");
    if (useGZ) res->setHeader("Content-Encoding", "gzip");
    res->setHeader("Cache-Control", strstr(f.name(),"list?") != nullptr ? "no-store" : "private, max-age=604800");
    if (download) {
        char dispStr[128];
        sprintf(dispStr, " attachment; filename = \"%s\"", fileName);
        res->setHeader("Content - Disposition", dispStr);
        ext = "application/octet-stream";
    }
    else {
        if (ext == "htm") ext = "html"; //workaround for encoding
        else if (ext == "js") ext = "javascript"; //workaround for encoding
        ext = "text/" + ext;
    }
    res->setHeader("Content-Type", ext.c_str());
    char buff[256];
    while (true) {

        uint16_t bytestoRead = f.available() < 256 ? f.available() : 256;
        if (bytestoRead == 0) break;
        f.readBytes(buff, bytestoRead);
        res->write((uint8_t*)buff, bytestoRead);
        //Serial.printf("Wrote %u bytes to %s\n", bytestoRead, f.name());
    }
}
void esp32_router::handleFile(HTTPRequest* req, HTTPResponse* res) {
    writeFileToResponse(req->getRequestString().c_str(), res);
    //debug headers
    //TODO: extract to general method
    // bool printHeaders = false;
    // if (printHeaders) {
    //     Serial.println("----------------------------------------------------------");
    //     Serial.println("                          HEADERS                         ");
    //     Serial.println("----------------------------------------------------------");
    //     for (int i = 0; i < req->getHTTPHeaders()->getAll()->size(); i++) {

    //         Serial.print(i); Serial.print(" ");  Serial.println(req->getHTTPHeaders()->getAll()->at(i)->print().c_str());
    //     }
    //     Serial.println("----------------------------------------------------------");
    // }

    
}


void esp32_router::handle404(HTTPRequest* req, HTTPResponse* res) {
    req->discardRequestBody();
    res->setStatusCode(404);
    res->setStatusText("Not Found");
    res->setHeader("Content-Type", "text/html");
    res->println("<!DOCTYPE html>");
    res->println("<html>");
    res->println("<head><title>Not Found</title></head>");
    res->println("<body><h1>404 Not Found</h1><p>The requested resource was not found on this server.</p></body>");
    res->println("</html>");
}


#endif

